       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEAP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-C   PIC 9(4).
       01 WS-D   PIC 9(4).
       01 WS-YEAR   PIC 9(4).
       01 WS-RESULT   PIC 9(1).
       PROCEDURE DIVISION.
       LEAP.
         DIVIDE 4 INTO WS-YEAR GIVING WS-C REMAINDER WS-D
         IF WS-D IS EQUAL TO 0 THEN
            MOVE 1 TO WS-RESULT
         DIVIDE 100 INTO WS-YEAR GIVING WS-C REMAINDER WS-D
         IF WS-D IS EQUAL TO 0 THEN
            MOVE 0 TO WS-RESULT
         DIVIDE 400 INTO WS-YEAR GIVING WS-C REMAINDER WS-D
         IF WS-D IS EQUAL TO 0 THEN
            MOVE 1 TO WS-RESULT
         CONTINUE.
       LEAP-EXIT.
         EXIT.
